///Локальные функции
&НаКлиенте
Функция ВставитьПараметры(Адрес,Параметры)
	Адрес = Адрес + "?";
	Для Каждого Параметр Из Параметры Цикл       
		Адрес = Адрес + Параметр.Ключ + "=" + Параметр.Значение + "&";
	КонецЦикла;
	Адрес = Лев(Адрес,СтрДлина(Адрес)-1);
	Возврат Адрес;
КонецФункции

///Глобальные функции
&НаКлиенте
Функция СгенерироватьШтрихКод(ТипШтрихКода,ШтрихКод) Экспорт
	HTTPСоединение = Новый HTTPСоединение("bwipjs-api.metafloor.com");
	Заголовки = Новый Соответствие;
	Параметры = Новый Структура;
	Параметры.Вставить("bcid",ТипШтрихКода);
	Параметры.Вставить("text",Строка(ШтрихКод));
	HTTPЗапрос = Новый HTTPЗапрос(ВставитьПараметры("",Параметры),Заголовки);
	Ответ = HTTPСоединение.ВызватьHTTPМетод("GET",HTTPЗапрос);
	ДД = Ответ.ПолучитьТелоКакДвоичныеДанные();
	ДД.Записать("C:\Users\snmsu\Desktop\test.png");
КонецФункции