///Локальные функции
&НаКлиенте
Функция ВставитьПараметры(Адрес,Параметры)
	Адрес = Адрес + "?";
	Для Каждого Параметр Из Параметры Цикл       
		Адрес = Адрес + Параметр.Ключ + "=" + Параметр.Значение + "&";
	КонецЦикла;
	Адрес = Лев(Адрес,СтрДлина(Адрес)-1);
	Возврат Адрес;
КонецФункции
//
&НаКлиенте
Функция ПолучитьИдентификаторШтрихкода(Тип)
	Если Тип = 0 Тогда
		Возврат "ean13";
	КонецЕсли;
	//TODO: Добавить остальные идентификаторы
КонецФункции
//
&НаКлиенте
Функция ПроверитьШтрихкод(ШтрихКод)
	//TODO: Описать проверку длины или содержания ШтрихКода
	Возврат Истина;
КонецФункции
//
&НаКлиенте
Функция ОбработатьОтвет(Ответ)
	//TODO: Описать проверку ответа сервера
	Возврат Истина;
КонецФункции

///Глобальные функции
&НаКлиенте
Функция СгенерироватьШтрихКод(Тип,ШтрихКод) Экспорт
	Если Не ПроверитьШтрихкод(ШтрихКод) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	HTTPСоединение = Новый HTTPСоединение("bwipjs-api.metafloor.com");
	Заголовки = Новый Соответствие;
	Параметры = Новый Структура;
	Параметры.Вставить("bcid",ПолучитьИдентификаторШтрихкода(Тип));
	Параметры.Вставить("text",Строка(ШтрихКод));
	HTTPЗапрос = Новый HTTPЗапрос(ВставитьПараметры("",Параметры),Заголовки);
	Ответ = HTTPСоединение.ВызватьHTTPМетод("GET",HTTPЗапрос);
	Если ОбработатьОтвет(Ответ) Тогда
		ДД = Ответ.ПолучитьТелоКакДвоичныеДанные();
		Адрес = ПоместитьВоВременноеХранилище(ДД);
		Возврат Адрес;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
